In [1]:
import pandas as pd

In [2]:
data=pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
data['b']

0.5

In [4]:
'a' in data

True

In [5]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [7]:
#명시적인 인덱스로 인덱싱
data['e']=1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [8]:
#명시적인 인덱스로 슬라이싱
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [9]:
#암묵적인 인덱스로 슬라이싱
data[0:2]

a    0.25
b    0.50
dtype: float64

In [10]:
#마스킹
data[(data>0.3)&(data<0.8)]

b    0.50
c    0.75
dtype: float64

In [11]:
#팬시 인덱싱
data[['a','e']]

a    0.25
e    1.25
dtype: float64

In [29]:
data=pd.Series(['a','b','c'],index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [13]:
data[1] #인덱싱 할 땐 명시된 인덱스 사용

'a'

In [14]:
data[1:3] #슬라이싱 할 땐 암묵적인 인덱싱 사용

3    b
5    c
dtype: object

In [9]:
data.loc[5]

'c'

In [30]:
data.loc[1:3]

1    a
3    b
dtype: object

In [17]:
data.iloc[1]

'b'

In [19]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [20]:
population_dict={"California":38332521,"Texas":26448193,"New York":19651127,"Florida":19552860,"Illinois":12882135}
pop=pd.Series(population_dict)
area_dict={'California':423967,'Texas':695662,'New York':141297,'Florida':170312,'Illinois':149995}
area=pd.Series(area_dict)

In [21]:
data=pd.DataFrame({'area':area,'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [21]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [22]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [22]:
data.area #속성을 통해 열을 불러온다. 이는 유용하지만, 속성이름과 같은 메서드가 있을 경우 유효하지 않다.
          #가령 pop메서드가 판다스에 존재하므로. data.pop()으로 인식될 것이다.
          #또한 속성이름이 문자열이 아닌 경우에도 속성으로 참조할 수 없다.

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [23]:
data.area is data['area']

True

In [24]:
data['density']=data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [25]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [26]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [27]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [23]:
data.values[0]

array([  423967, 38332521], dtype=int64)

In [31]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [24]:
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [33]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [35]:
data.loc[:'Illinois',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [36]:
data.ix[:3,:'pop']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [37]:
data.loc[data.density>100],['pop','density']

(            area       pop     density
 New York  141297  19651127  139.076746
 Florida   170312  19552860  114.806121,
 ['pop', 'density'])

In [39]:
data.iloc[0,2]=90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [56]:
data.iat[1,2] #좌표계를 활용한 인덱싱

38.01874042279153

In [51]:
data.iloc[:,1]

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64

In [27]:
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [25]:
data['Florida':'Illinois'] #슬라이싱은 행을 참조해서 가져온다

            area       pop
Florida   170312  19552860
Illinois  149995  12882135

In [26]:
data[1:3]

            area       pop
Texas     695662  26448193
New York  141297  19651127

In [58]:
data[data.density>100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [59]:
data[data['density']>100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121